# tap "homebrew/core"
tap "homebrew/bundle"
# tap "homebrew/cask"
tap "homebrew/cask-fonts"

tap "ankitpokhrel/jira-cli"

brew "bash-completion"
brew "bat"
brew "bkt"
brew "ca-certificates"
# Homebrew won't symlink curl bc Mac already has it and symlinking may cause problems
# brew "curl"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "grep"
brew "gum"
brew "jira-cli"
brew "less"
brew "lf"
brew "libfido2"
brew "lsd"
brew "neovim"
# brew "nushell"
brew "openssh"
brew "openssl"
brew "pipx"
brew "pyenv"
brew "qrencode"
brew "ripgrep"
brew "sops"
brew "sshpass"
brew "starship"
brew "tree"
brew "unzip"
brew "zsh"

cask "font-caskaydia-cove-nerd-font"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-sans-cjk"

cask "amethyst"
cask "hiddenbar"
cask "kitty"
cask "rectangle"
